#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "1a9187caf07e598a164478d42fa8fe80" -> "819d335db5ebe00eeae8ba7dcf113cc6"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "138fce208455867cdf795c2157cedc06" -> "25d8d5b5dd04513b36587f40c80b3c7a"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "c1123ff65e58455c2803610a9c139e22" -> "ed077cbc28f356dc434fb9b6ecf931a9"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "fdb22b03186e034d2f3ad36a8ac9c359" -> "86ad61f30f99ed8855ffe82e116a721b"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "a231e48c3825c28030c27db9e0762522" -> "dd8deab54dd7dcdd4fe4246ef92686ed"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3c74802ac168ad18370a9f18da5daf4a" -> "efed34985ed360b475703e2e7306197a"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "7780a3644ae34baea4133c41027a1077" -> "f790732106c522f1267cc5ed1acf42c9"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "299797f3ff7c4db9b9ef89e470a3f2dd" -> "1d3ce7f59d78dc98dbd32b760e2b181e"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "a74f9553df3db6adf2f153d872e8d860" -> "996fbfd9706d75e6f07f9093e9093f74"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "a9e96dbf874739ace423d7db4b349a24" -> "5f280fee3079fe89a3eae0763b9df258"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "d6a908d8bd9812de11063cc3b8c9aee9" -> "c0e9cd445116221c8ed67f914036a0eb"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "f3eb11b6122a44e7bf9e19a19bfed129" -> "f41f3cc0cad489be3798f2dd0add6bdc"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "099462c75bbc35aad64420b3abc39b52" -> "50b111303d0423c377954751eb0f893e"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "50b27f722a90029c64a48bfe8cdcf4e5" -> "f7e52b93bb9cc5cf1e2512a235112737"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "18ca3c99a66eb872d249c3490029ed34" -> "f5d1d7b6f936c544090a183f0ce30c2f"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "99b554252bac292eb30aaf462d724c9e" -> "012ce046062677d615374196d93996d9"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e18529d699f31c43c6d9eafba39d989e" -> "90c97b2794fc9282ff6c42fabfb38163"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "f36e8605fcd9e936796a88a406dd71b0" -> "8e12c5d751699f26617c3b6532814b8a"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "a5ae479002b6f16a560b5ccec763f3e7" -> "26e427cd1bb895078a76e418db6591e7"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "415d53d97baa11dc0dab3ba758fa7b7a" -> "768df765212c121fb25c95256e4238c8"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "40dbf7d1124fce793d8a43a9bf521441" -> "a7e3866f85b82d8c11adf036af4fe834"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "df9eac77089b99937a4a71d00af0b48e" -> "89848d6f9ceacd50ef9531cd02b6c21a"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "4f0f4ce63589fefe35b8c48c5c86d70a" -> "d3fabaa7a4b1c032767bdf3ec179e386"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7dc88662e87e6e7761554adac895ace4" -> "771331bb965381ebcc144389d33cde98"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "e3c8f5573556400524022efe3f0dbf15" -> "a11525d8bacd06e351fd77afd3f8ad79"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "499879305c585bd5403d803e2a16f9a8" -> "077702d3e96525f7f874702a79587492"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "fa293ecd20f81b6c6f5c864df2e3849a" -> "537c4012a5db2c0403ad7659846e1eec"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "457ef580b09d15d2671bfe6af93c51dc" -> "5076ddc818d59095bb69b125681ecb63"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "1bcc6f3537817de051ccdd97d707471f" -> "6022420deba7a211b8acea8b98a99542"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "f6a0bcdabe4c814892d1d22a15740f60" -> "fcc0a4aa4328ecf77c40ef5bde817332"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "a4cbb79da720dedc8e7544b2f15ef541" -> "c90755541dd7dc8ca6c505b04d761db0"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ccd3aa0a1eab82590e3c7fbf6ef169d4" -> "1a3bcbcbc9ed4a1854568042e4e3783c"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "0e4631e01fec92596df50d2db5186c79" -> "834bd2f87f725675b4ee1b2d25412e6f"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "682e75b1caf450f69cadd1b7934c1daf" -> "0e27b35bebdb79406a47b5ced4258ee5"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "c92f854ec3ab0bdbbf735bd8ad667ff9" -> "8319b9406cb15452f1eccfdb8e2c5bbc"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "4541bdc7d425655afc57bb6a017c4ea3" -> "6f7ca9274af643cfff6240f4f11ed2db"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "6de3126cbc05066bef3960b24bbb456e" -> "257ade69e933ad1480333e8dd092e703"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "f806ab407aa795eb4f7d6a84bb92e072" -> "515db883d4735db6adc5734abd71dd40"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "3fab50b2cfbee531fb8a2ec71118dd53" -> "5b8464f8b65ace8ac22cdef7e1454fba"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "5630e63e86ce2377129a4647f5c85211" -> "ed1d86bd3ccbe3401fee17d1111b8bbf"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0a23d2a43a498e54f6bb0ac87e09f906" -> "8acd696ad1c00c5e8e2318d01020d637"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "972a8e8857b05d045f749fce9346e004" -> "aded8c743f7005c5d26bc0cdc7d86e9c"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "bae2aaa22e35c2804cec31aa8579115f" -> "c6c0b3ada95baa1ef58d2a7318fbaea8"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "bac493b72cd8eec4a9721f85b6891615" -> "d3c8b97bb4a309c70b3d426f892874fe"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "ccff770714c5e867fa2c6e89d056d82c" -> "66013f7067bf50d3bc1bf366f764ba0f"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "29eec7318948fc39aed191b40826a4a3" -> "45bcc4d1cf4692d3ec4af5e738564d57"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "15d4198afe2f5f8c93f2e51736bdd5f9" -> "e6fea12ec374f056a11d450240f49d01"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "VJzi2FZAjWs3gCL4yaWdfdoWVbbdeIAA8O5nCT/lSzc=" -> "I93Vw3SgCgePa6H779ChhKyMGvUAs3Q+JG44uwFAwiE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "HfsPnfFwAcCKIIRR3kIvjdOVsd5kWaaRa1k/HESLvyw=" -> "Yn+mEQ9m+TXpPq6DqDEnnV3zZkmiw1/oHg0roCAfzRc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "G0oZmQWS1IuPjJ7XxNs7Xp+P1DhHAuymm9Ke6AMC3b8=" -> "7mQyiIdvIf39Ex/bR/yMsdT9DZx1sm/MfWchQIOxGqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "UHI16C/6AHoAq8VMWtvuAWvyRso6KO8Ytu1VazKbaPQ=" -> "sRucJQldaEkmc/7NXsYdC5PaDR32iZwVRN1NyHc6wp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "DA7Yk46+3X9vCyfgStYrt16zlwo6eBFej/SzGn5V3CQ=" -> "JoHvNuTY4C5Hdr1cEyN4Ky9cQBuCjJkGgFAReBCbHl0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZo9QajI4Pyzxp7DtwGVs/lTFZbTaWFr9UVHI78fglA=" -> "hWfCDKPiDsdiMZEHbIwJpccPrjQc/jAVF0RiJX3yvA4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k85PMPiIvePYFtySZIL7VSIFbxwnwf+B9byMlZig+Q=" -> "u/akVvWTVlq9qiBfCoqPai1uCABgbwYKyTQMrqMbe50="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "DYbVgi+8YHrYe7pGXzrm6ek93YeV+kIHNziI1pOoGKA=" -> "2sY+4p+xE+rq2YVDmE2Lf46FnmDGkjL954xjCzLnBDY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "1ywQdkuBJ/nEtZV7D88RKHFha+d5qeGeQhPY/RlLyx4=" -> "xkEpqODjqLrCt+YLYW/jFJmtfG8PFfk44eRRVyjPqA0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "zATW/1W49/GwSXlgtYq3Fz/UxCXmjl2FnR4LA/V9MU0=" -> "fgBZosoa0DjVD0p/q+44c0hSx6Bn0XCKrUXrCzD0cv8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LRcZXQ0vFBCUroGE6pAw4buAhLU4IaFAGwqXFPeOKRw=" -> "SbiR3ROvqMvpr9w6QmSMVeaGa8MZEqSHb9/CrorgxcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "IoIDDv8t2G5DXlKnVXRmDmk27GDUHosU0swzEY63zlI=" -> "L3E/Zb1LLrb2xfbZ6YAneI9vdvaphq0k1ShZ3TooEWk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "kx1bsToC3y2yGpUUsEeSt99ZOqrE7jTTgi8C4xBJywg=" -> "tLWNkSrTP/vtAMIDCP8dsE8spXx1wM14FB9xPFHbekE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "kWhev/K1zW2wAyWSh+F3gIydRp1gl6tntrag3zQ2aNA=" -> "b2O1i7X4ckHnl9UKkbbfTb9hsqPyCV0XSZpasU/Nv0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "PX3mSayp0CcYSsyoCrhgsG6+b/OI5GE2NGGRBLAsd2o=" -> "Vj+IqWcYUaOO8LuUB3Bd4wqSENVrqd1yeLuAJBreOBs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "PIPdwsYUi+hjvJSqqsojSrgWbe+RyxtU+r4cIKt459U=" -> "Jwu+27ximSWy7LgoQPfFQIkm+gR5PHnYsjHazwayP4Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "9hP3+UGOt2c6Kl/eylW7ei7QVUWbo5HxYBDaz5DhfFA=" -> "+TbhCk1+NA/DV5zAFHws56IR3Oz29Ad8dAZwBQnU2k8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "biIy3xSjWPSuEp3/1l3GyHhi+jWJkV+s/S9ffh1Mu98=" -> "tGzQ0qmQIhDApV7Kfz5R/LuBpE9wU/dF9MKtKVytTG4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "T8xXPXa/LSn3msarzgtF5wwjfSDZCA8jew9D2VDsEuk=" -> "RQm0mtINTsgffHuSQ58Ix3YlT4NpzBn0gzu+eKhYKQU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "K3ayvGV2Jes9mgXfkjcet7AvxB/TYn1f2vvNGZqTFQs=" -> "oNr6Ge6GU6XXRhd5clca+2D3gRlqxow4kW5gU7hX/b4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xmG7coqLvkn5DPg+GQXITO78hcUWtDyNTjZBbqOcNwY=" -> "u3Jaz/+JPJIxeKHB5Hcg6ePrlV7sZMSSWFIaVXE9ScQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "d1nToCh0it2WqLEaIiz6XhpmzzA+AFUXiKM52Xu6U10=" -> "A6GhA7PSbuK5rkL/CNvgSoCmjunfx117bE8pMIfdQ9Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/eQCpOiFic/fYSeHd1L5RzY32n2GqeK0klu1xWNex3M=" -> "+qhxS/qbhGsfh/D+tUIMvvmA099amvyhIAz89pAuF34="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "rARbwgGSfqLhTNTcEmUiGsaV3PJCkOxFQGErlda6Kjk=" -> "DXM+v24sXaxo4QykG+XDzwkMzqhsNt6HoC0CygArTks="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQNRRCnvfUEauOWa55m7I+xQQuy4DA2SsYxd6GXn450=" -> "MfkRpVSo86Q3auhXuRrkWMSygsilyj8K0xbgbDjX/Nc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "8N/uXKdcl83E3y6cjPq5Vo0L4RmwfJYzh/TiwZEgiKg=" -> "Otq0fouqKB/cIRQyjRNgxn5MqXjOMmCK4IIPg+UrSuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "rph39hHqJYN+OXMDpQfEvT9SyudPKsQCrI09Oaszq/M=" -> "TODdsmKuqxtTzAbi0sJ+zUmMFg4FLeDCP5mlGwn9gqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "LmY1896e52qDZWkI3NuDYb2Yoow4PnheJygi8KVCRpI=" -> "oLRBFYQavT9E2cyv3ub2EwtqCjW15AUNzHE/Sc30J3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "BMvOY6h3yZRrpu7SIO5slmo7Ub18OAmL9b0WggrrQnI=" -> "r1aDd+ZNT6FBIz1jjZxAL4lr/yEvPfHGWp/4TwTLFMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/6dfpuTjanEVov8jgWUoe4j9L25O5nPD/r5tGB2LAU=" -> "cYHz3lGcYVJcAgNcby5xGYH1fVpGVAdeuSTrvFOqs04="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-28T17:35:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "ImognsbpJo4OLq3HecNAx2o0Y9Y0dJL1s8cvzHmCNoM=" -> "6rPD576sNK3l3iS2c/+MepYgFrRdvKRLqdRefpEpX/M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "GfAOxrw/atfTjDf5Slf+h21iBbmHFZLv3AqbZoMBMqM=" -> "bcGv+H/DVGcNHwYOyyIqFvsKen4cTWOqQasarBJrgCQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "xk56/2fDVt0nFuQ4ybtFGsYQweO4dzW31fHJqjcD4UY=" -> "ZTwyl+wgAwv3UR0gngXnvVg5Qz95r9uZpuj5UR5s3Wc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "c5A7U6aVtpRZRERXUHknoOdyggTyWKONqa/TIQOSsWE=" -> "FA6dmzhhNhqk5CaNVXks8162Q51Fn6Xl1zuaMQxH8aQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "xj9Q2SkaEJ8dUej7DvnHDx520J0/3JZk2+VNTvta560=" -> "ASTmYgThDYDUdbyvWSySJBejBdmfZYTOTmvmibP6q0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+YnPZGcYbYKNbf5MEgWMNH/ayzXSQl4DCPq29cKoV7Q=" -> "mi9UKPUspRDYUMzrNNSxUCoTfCP4AsJ7nDnyIHeiTLQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mok1sWN2I0vZpSz2LQ7Hya5Mv7+W4cTNqMS7PI+iYYY=" -> "/M500HgiI+SeYKwNuGrgBXQBuax2JB5rZ6aNcg66IGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MtkxsJONSm4xP2azLn7eSvAjiCLVNk04xctBr5Xp5Qw=" -> "SuEYSBoOYqDloc+lERRIfypMg14/2QU695+PsDfBAuk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "tNJ+auMsdJIf6WNHGHUMLs73sXQZTI019JIXI0Xrlg8=" -> "YCJdolUqZoo9xkRlFUUnep4fX9xrcXTq6tPyn5NOAo4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "/zYmg18AUpLAQ3yCgrCyAj/08/Ar41PzX3mi7sAzG1I=" -> "S7k/waaAdSz1QLwDzOh3hUfgFmJQyxjWadfpumvZehg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "gua1kqpNTQVklaE7AoOyajWYC3UgQp2oYAb0vhR/M+U=" -> "ajw8TbT0cvIxYS7cpie1JvgTQ8g1LdgHawZ7svGSGr4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "SCgMzA5srf2nA5kfdD697XtlWOpZZzKgydItBU7vQ2M=" -> "8jodMLP6wMhRTC92vyEpwxG2zFXpExOjK07bhm4Bepk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ESeZnaifn72asVnZDCPDMIgKkOgXfYlm0PoEK8zuSf4=" -> "SWRWQ+6dd2aq6UUhW/+WTU1Kg42BgZ8EVrrGaooA4GI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "/TZ1vGdMjchIyprAh+tyg6TGcWpl3MQ7mVLbnRCgSj0=" -> "pl/yMUFngXJtyVd+1sUJV0R8lhLBWWp+aLtAJJL3uvM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-25T06:35:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "z10zdYdvtZH25sJVPWV2zeUNy14GR+P2dBQCtx1kH8I=" -> "QHgIhDzhWF1b4e+6abYEqiNjzvaFuPb6qB0+IIuuSJk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-25T06:34:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "a9Uhfb6/OPj58LqMguuslqsSuPPbvk66hDmDq0pJ5/Q=" -> "KQM/Orsj91twnbwSv+wOTpaLob7I1dqVaMJfjYDF1ag="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-25T06:34:22Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "edetfb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-25T06:34:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*